Repository: abduvalimurodullayev1/ProjectExam
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ru

source: Car brand
ru: Марка автомобиля

source: Model
ru: Модель

source: Color
ru: Цвет

source: ❌ Sizning faol deteksiyalaringiz topilmadi.
ru: ❌ Ваши активные детекции не найдены.

source: 📝 Sizning deteksiyalaringiz ro'yxati.
ru: 📝 Список ваших детекций.

source: ❌ Deteksiya topilmadi.
ru: ❌ Детекция не найдена.

source: ✅ Deteksiya muvaffaqiyatli o'chirildi!
ru: ✅ Детекция успешно удалена!

source: ❌ Deteksiya topilmadi yoki o'chirishda xato yuz berdi.
ru: ❌ Детекция не найдена или произошла ошибка при удалении.

source: Quyidagilardan birini tanlang
ru: Выберите одно из следующих действий

source: Available commands: /start - Start the bot /help - Get help
ru: Доступные команды: /start - Запустить бота /help - Получить помощь

source: 🔍 Qaysi avtomobil brendini tanlaysiz?
ru: 🔍 Какую марку автомобиля вы выберете?

source: 🚗 Qaysi modelni tanlaysiz?
ru: 🚗 Какую модель вы выберете?

source: 🔧 Filtrlarni tanlang:
ru: 🔧 Выберите фильтры:

source: 🟦 Mashinaning rangini tanlang:
ru: 🟦 Выберите цвет машины:

source: 📏 Yurgan masofa oralig'ini tanlang:
ru: 📏 Выберите диапазон пробега:

source: {} tanlandi!
ru: {} выбрано!

source: 📅 Yilni kiriting (masalan: 2010-2020):
ru: 📅 Введите год (например: 2010-2020):

source: {} oraligi tanlandi!
ru: Выбран диапазон {}!

source: Telefon raqamingizni jo`nating
ru: Отправьте свой номер телефона

source: To`g`ri formatda raqam jo`nating yoki buttondan foydalaning
ru: Отправьте номер в правильном формате или воспользуйтесь кнопкой

source: Ismingizni jo`nating
ru: Отправьте ваше имя

source: Sizning ismingiz: {name} Telefon raqamingiz: {phone_number} Tiliz: {language} Sizning registratsiyani yakunlashingiz uchun tugmasini bosing
ru: Ваше имя: {name} Ваш номер телефона: {phone_number} Ваш язык: {language} Нажмите кнопку, чтобы завершить регистрацию

source: 🗞Yangi detektsiya yaratish.
ru: 🗞 Создать новую детекцию.

source: 🔄Faol detektsiyalar
ru: 🔄 Активные детекции

source: ⚙️Sozlamalar
ru: ⚙️ Настройки

source: O'zbek
ru: Узбекский

source: English
ru: Английский

source: Muloqot tili
ru: Язык общения

source: Telefon
ru: Телефон

source: Asosiy menu
ru: Главное меню

source: ❌ Faolsizlantirish
ru: ❌ Деактивировать

source: ✅ Faol qilish
ru: ✅ Активировать

source: 🔧 Filtrlarni o'zgartirish
ru: 🔧 Изменить фильтры

source: 📊 Hisobot
ru: 📊 Отчет

source: 🗑 O'chirish
ru: 🗑 Удалить

source: ✅ Tanlashni tugatish
ru: ✅ Завершить выбор

source: 0-10 ming km
ru: 0-10 тысяч км

source: 10-50 ming km
ru: 10-50 тысяч км

source: 50-100 ming km
ru: 50-100 тысяч км

source: 100 ming km+
ru: 100 тысяч км+

source: ✅ Tamom
ru: ✅ Готово

source: 🔎 Filtrlarni o'zgartirish
ru: 🔎 Изменить фильтры

source: Deteksiyani ishga tushurish
ru: Запустить детекцию

source: Ortga
ru: Назад

source: Created at
ru: Дата создания

source: Updated at
ru: Дата обновления

source: Active
ru: Активный

source: Inactive
ru: Неактивный

source: Banned
ru: Заблокирован

source: Uzbek
ru: Узбекский

source: Russian
ru: Русский

source: Phone number
ru: Номер телефона

source: Name
ru: Имя

source: Status
ru: Статус

source: Date Joined
ru: Дата регистрации

source: Language
ru: Язык

source: Statistics
ru: Статистика

source: User
ru: Пользователь

source: Users
ru: Пользователи
